AndreJansenvanRensburg/PSoC-6-MCU-Device-Related-Design/Bootloaders/CE216767 - PSoC 6 MCU with BLE connectivity Bootloader/Bootloader_BLE_App0.cydsn/main_cm4.c
/*******************************************************************************
* File Name: main_cm4.c
*
* Version: 1.20
*
* Description: This file provides the source code for the Bootloader (App0)
*              running on the Core M4 (Core1).
*              App0 Core1 firmware does the following:
*              - Bootloads App1 firmware image if Host sends it
*              - Switches to App1 if App1 image has successfully bootloaded
*                and is valid
*              - Switches to existing App1 if button is pressed
*              - Turn on an LED depending on status
*              - Hibernates on timeout
*******************************************************************************
* Related Document: CE216767.pdf
*
* Hardware Dependency: CY8CKIT-062-BLE PSoC 6 BLE Pioneer Kit
*                      CY5677 CySmart USB Dongle
*
******************************************************************************
* Copyright (2017), Cypress Semiconductor Corporation.
******************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#include <string.h>
#include "project.h"
#include "debug.h"
#include "ias.h"
#include "transport_ble.h"

#if CY_BOOTLOAD_OPT_CRYPTO_HW != 0
    #include "cy_crypto_config.h"
    cy_stc_crypto_context_t cryptoContext;
#endif /* CY_BOOTLOAD_OPT_CRYPTO_HW != 0 */

/* BLE GAPP Connection Settings */
#define CYBLE_GAPP_CONNECTION_INTERVAL_MIN  (0x000Cu) /* 15 ms - (N * 1,25)*/
#define CYBLE_GAPP_CONNECTION_INTERVAL_MAX  (0x000Cu) /* 15 ms */
#define CYBLE_GAPP_CONNECTION_SLAVE_LATENCY (0x0000u)
#define CYBLE_GAPP_CONNECTION_TIME_OUT      (0x00C8u) /* 2000 ms */

/* BLE Callback function */
void AppCallBack(uint32 event, void* eventParam);

/* Internal functions */
static bool IsButtonPressed(uint16_t timeoutInMilis);
static uint32_t counterTimeoutSeconds(uint32_t seconds, uint32_t timeout);

static cy_en_bootload_status_t CopyRow(uint32_t dest, uint32_t src, uint32_t rowSize, cy_stc_bootload_params_t * params);
static cy_en_bootload_status_t HandleMetadata(cy_stc_bootload_params_t *params);

/*******************************************************************************
* Function Name: main
********************************************************************************
*
* Summary:
*  Main function of the bootloader application (App0).
*  1. If application started from Non-Software reset it validates App1
*  1.1. If App1 is valid it switches to App1, else goto #2.
*  2. Start bootloading communication.
*  3. If updated application has been received it validates this app.
*  4. If App1 is valid it switches to it, else wait for new application.
*  5. If 300 seconds have passed and no new application has been received
*     then validate App1, if it is valid then switch to it, else hibernate
*     (Happens in the BLE AppCallBack).
*
*******************************************************************************/
int main(void)
{
    /* timeout for Cy_Bootload_Continue(), in milliseconds */
    const uint32_t paramsTimeout = 20u;
    
    /* Bootloader params, used to configure bootloader */
    static cy_stc_bootload_params_t bootParams;
    
    /* Status codes for Bootloader SDK API */
    cy_en_bootload_status_t status;
    
    /* SW2 released after deciding to stay in bootloader */
    bool buttonReleased = false;
    
    /* 
    * Bootloading state, one of
    * - CY_BOOTLOAD_STATE_NONE
    * - CY_BOOTLOAD_STATE_BOOTLOADING
    * - CY_BOOTLOAD_STATE_FINISHED
    * - CY_BOOTLOAD_STATE_FAILED
    */
    uint32_t state = CY_BOOTLOAD_STATE_NONE;
    
    cy_en_ble_api_result_t apiResult;
    cy_stc_ble_stack_lib_version_t stackVersion;
    
    /*
    * Used to count seconds, to convert counts to seconds use
    * counterTimeoutSeconds(SECONDS, paramsTimeout)
    */
    uint32_t count = 0;
    
    uint32_t ledTimer = 0;
    
#if CY_BOOTLOAD_OPT_CRYPTO_HW != 0
    cy_en_crypto_status_t cryptoStatus;
#endif

    /* Buffer to store bootloader commands */
    CY_ALIGN(4) static uint8_t buffer[CY_BOOTLOAD_SIZEOF_DATA_BUFFER];

    /* Buffer for bootloader packets for Transport API */
    CY_ALIGN(4) static uint8_t packet[CY_BOOTLOAD_SIZEOF_CMD_BUFFER];    
    
    /* Enable global interrupts */
    __enable_irq();
    
    /* Start UART Services */
    UART_START();
    
