AndreJansenvanRensburg/PSoC-6-MCU-Device-Related-Design/Bootloaders/CE216767 - PSoC 6 MCU with BLE connectivity Bootloader/Bootloader_BLE_App0.cydsn/main_cm4.c
    /* Initializes LEDs */
    InitLED();
    
#if CY_BOOTLOAD_OPT_CRYPTO_HW != 0
    /* Initialize the Crypto Client code */
    cryptoStatus = Cy_Crypto_Init(&cryptoConfig, &cryptoContext);
    if (cryptoStatus != CY_CRYPTO_SUCCESS)
    {
        /* Crypto not initialized, debug what is the problem */
        Cy_SysLib_Halt(0x00u);
    }
#endif /* CY_BOOTLOAD_OPT_CRYPTO_HW != 0 */

    /* Initialize bootParams structure and Bootloader SDK state */
    bootParams.timeout          = paramsTimeout;
    bootParams.dataBuffer       = &buffer[0];
    bootParams.packetBuffer     = &packet[0];

    status = Cy_Bootload_Init(&state, &bootParams);

    /* Ensure Bootloader Metadata is valid */
    status = HandleMetadata(&bootParams);
    if (status != CY_BOOTLOAD_SUCCESS)
    {
        Cy_SysLib_Halt(0x00u);
    }
    
    /*
    * In the case of non-software reset and user does not
    * want to stay in bootloader check if there is a valid app image.
    * If there is - switch to it.
    */
    if ((Cy_SysLib_GetResetReason() != CY_SYSLIB_RESET_SOFT) && (IsButtonPressed(2000u) == false))
    {
        status = Cy_Bootload_ValidateApp(1u, &bootParams);
        if (status == CY_BOOTLOAD_SUCCESS)
        {
            /*        
            * Clear reset reason because Cy_Bootload_ExecuteApp() performs        
            * a software reset.        
            * Without clearing two reset reasons would be present.        
            */
            do
            {
                Cy_SysLib_ClearResetReason();
            }while(Cy_SysLib_GetResetReason() != 0);
            /* Never returns */
            Cy_Bootload_ExecuteApp(1u);
        }
    }
    
    /* Initialize bootloader communication */
    Cy_Bootload_TransportStart();
    /* Initializes the Immediate Alert Service */
    IasInit();
    
    /* Output current stack version to UART */
    apiResult = Cy_BLE_GetStackLibraryVersion(&stackVersion);
    if(apiResult != CY_BLE_SUCCESS)
    {
        DBG_PRINTF("CyBle_GetStackLibraryVersion API Error: 0x%2.2x \r\n", apiResult);
    }
    else
    {
        DBG_PRINTF("Stack Version: %d.%d.%d.%d \r\n", stackVersion.majorVersion, 
            stackVersion.minorVersion, stackVersion.patch, stackVersion.buildNumber);
    }
    
    for(;;)
    {
        /* CyBle_ProcessEvents() allows BLE stack to process pending events */
        Cy_BLE_ProcessEvents();

        /* Process bootloader commands */
        status = Cy_Bootload_Continue(&state, &bootParams);
        ++count;

        switch(state)
        {
        case CY_BOOTLOAD_STATE_FINISHED:
            /* Finished bootloading the application image */
            
            /* Validate bootloaded application, if it is valid then switch to it */
            status = Cy_Bootload_ValidateApp(1u, &bootParams);
            if (status == CY_BOOTLOAD_SUCCESS)
            {
                Cy_Bootload_TransportStop();
                /*        
                * Clear reset reason because Cy_Bootload_ExecuteApp() performs        
                * a software reset.        
                * Without clearing two reset reasons would be present.        
                */        
                do
                {
                    Cy_SysLib_ClearResetReason();
                }while(Cy_SysLib_GetResetReason() != 0);
                /* Never returns */
                Cy_Bootload_ExecuteApp(1u);
            }
            else if (status == CY_BOOTLOAD_ERROR_VERIFY)
            {
                /*
                * Restarts Bootloading, alternatives are to Halt MCU here
                * or switch to the other app if it is valid.
                * Error code may be handled here, i.e. print to debug UART.
                */
                status = Cy_Bootload_Init(&state, &bootParams);
                /* Reset LED */
                ConnectedLED();
                ledTimer = 0;
                Cy_Bootload_TransportReset();
            }
            break;
        case CY_BOOTLOAD_STATE_FAILED:
            /* Handle error here */
            DBG_PRINTF("Bootloading has failed with error code 0x%x, try again\r\n", status);
            
            /* In this Code Example just restart bootloading process */
            status = Cy_Bootload_Init(&state, &bootParams);
            /* Reset LED */
            ConnectedLED();
            ledTimer = 0;
            Cy_Bootload_TransportReset();
            break;        
        case CY_BOOTLOAD_STATE_BOOTLOADING:            
            /* Reset timeout counter, if a command was correctly received */
            if (status == CY_BOOTLOAD_SUCCESS)
            {
                count = 0u;
            }
            else if (status == CY_BOOTLOAD_ERROR_TIMEOUT)
            {
                /*
                * if no command has been received during 5 seconds when the bootloading
                * has started then restart bootloading.
                */
                if (count >= counterTimeoutSeconds(5u, paramsTimeout))
                {
                    count = 0u;
                    Cy_Bootload_Init(&state, &bootParams);
                    /* Reset LED */
                    ConnectedLED();
                    ledTimer = 0;
                    Cy_Bootload_TransportReset();
                }
            }
            else
            {
                count = 0u;
                /* Delay because Transport still may be sending error response to a host */
                Cy_SysLib_Delay(paramsTimeout);
                Cy_Bootload_Init(&state, &bootParams);
                Cy_Bootload_TransportReset();
            }
            break;
        }
        
        /* LED logic, constant values are optimized out. */
        /* Reset timer after 2 seconds */
        if(ledTimer == (2000u / paramsTimeout)) ledTimer = 0;
        /* Every 100 miliseconds */
        if(!(ledTimer % (100u / paramsTimeout)))
        {
            /* Generates two 100 miliseconds pulses, every 2 seconds */
            if((state == CY_BOOTLOAD_STATE_BOOTLOADING) && (ledTimer < (400u / paramsTimeout)))
            {
                BlinkLED();
            }
            /* Generates one 100 miliseconds pulse, every 2 seconds */
            else if ((Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_ADVERTISING)
                     && (ledTimer < (200u / paramsTimeout)))
            {
                BlinkLED();            
            }
            else
            {
                /* Remain OFF */
                ConnectedLED();
            }
        }
        ++ledTimer;
        
        /* Check if a switch to the other app is requested and perform the switch if it is */
        if((buttonReleased == true) && (state == CY_BOOTLOAD_STATE_NONE))
        {
            bool switchRequested = false;
            if (alertLevel != 0)
            {
                switchRequested = true;
            }
            else if(IsButtonPressed(500u) == true)
            {
                switchRequested = true;
                buttonReleased = false;
            }
            if (switchRequested)
            {
                /* Validate and switch to App1 */
                cy_en_bootload_status_t status = Cy_Bootload_ValidateApp(1u, &bootParams);
                
