AndreJansenvanRensburg/PSoC-6-MCU-Device-Related-Design/Bootloaders/CE216767 - PSoC 6 MCU with BLE connectivity Bootloader/Bootloader_BLE_App0.cydsn/main_cm4.c
    case CY_BLE_EVT_GAP_DEVICE_DISCONNECTED:
        DBG_PRINTF("CYBLE_EVT_GAP_DEVICE_DISCONNECTED\r\n");
        /* Put the device into discoverable mode so that a remote can search it. */
        apiResult = Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_FAST, CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX);
        if(apiResult != CY_BLE_SUCCESS)
        {
            DBG_PRINTF("StartAdvertisement API Error: %d \r\n", apiResult);
        }
        break;
    
    case CY_BLE_EVT_GAP_ENCRYPT_CHANGE:
        DBG_PRINTF("CYBLE_EVT_GAP_ENCRYPT_CHANGE: %x \r\n", *(uint8 *)eventParam);
        break;
    
    case CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE:
        DBG_PRINTF("CYBLE_EVT_CONNECTION_UPDATE_COMPLETE: %x \r\n", *(uint8 *)eventParam);
        break;
    
    case CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP:
        if(Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_STOPPED)
        {   
            /* Fast and slow advertising period complete, go to low power  
             * mode (Hibernate mode) and wait for an external
             * user event to wake up the device again */
            
            /* Stop bootloading communication */
            Cy_Bootload_TransportStop();
            /* Check if app is valid, if it is then switch to it */
            uint32_t status = Cy_Bootload_ValidateApp(1u, NULL);
            if (status == CY_BOOTLOAD_SUCCESS)
            {
                /*        
                * Clear reset reason because Cy_Bootload_ExecuteApp() performs        
                * a software reset.        
                * Without clearing two reset reasons would be present.        
                */
                do
                {
                    Cy_SysLib_ClearResetReason();
                }while(Cy_SysLib_GetResetReason() != 0);
                /* Never returns */
                Cy_Bootload_ExecuteApp(1u);
            }
            /* 300 seconds has passed and App is invalid. Hibernate */
            HibernateLED();
            Cy_SysPm_Hibernate();
        }
        break;

    /**********************************************************
    *                       GATT Events
    ***********************************************************/
    case CY_BLE_EVT_GATT_CONNECT_IND:
        appConnHandle = *(cy_stc_ble_conn_handle_t *)eventParam;
        DBG_PRINTF("CYBLE_EVT_GATT_CONNECT_IND: %d \r\n", appConnHandle.bdHandle);
        break;
    
    case CY_BLE_EVT_GATT_DISCONNECT_IND:
        DBG_PRINTF("CYBLE_EVT_GATT_DISCONNECT_IND: %d \r\n", ((cy_stc_ble_conn_handle_t *)eventParam)->bdHandle);
        break;
    
    case CY_BLE_EVT_GATTS_WRITE_CMD_REQ:
        DBG_PRINTF("CYBLE_EVT_GATTS_WRITE_CMD_REQ\r\n");
        break;

    default:
        break;
    }
}


/* [] END OF FILE */
